backend/app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "message_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["message_id", 1], ["created_at", "2024-04-20 12:26:46.335426"], ["updated_at", "2024-04-20 12:26:46.335426"]]
---
  def create
    # paramsはパラメータを参照
    like = Like.new(message_id: params[:id], user_id: current_user.id)

    if like.save

SELECT "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 7]]
---
  def destroy
    like = Like.find(params[:id])

    if like.destroy