backend/app/controllers/messages_controller.rb

SELECT "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "test1@test.com"], ["LIMIT", 1]]
SELECT "messages".* FROM "messages"
SELECT "likes".* FROM "likes" WHERE "likes"."message_id" = ?  [["message_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    messages = Message.eager_load(:user, [likes: :user])
    messages_array = messages.map do |message|
      {
        id: message.id,
        user_id: message.user.id,
        name: message.user.name,
        content: message.content,
        email: message.user.email,
        created_at: message.created_at,
        # likesレコードを二次元配列で保持する
        likes: message.likes.map { |like| {id: like.id, email: like.user.email} }

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
UPDATE "messages" SET "content" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["content", "こんにちは（編集済み）"], ["updated_at", "2024-05-07 16:48:38.609525"], ["id", 28]]
---
  def update
    message = Message.find(params[:id])
    if message.update(message_params)

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 37], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 37]]
---
  def destroy
    message = Message.find(params[:id])

    if message.user_id == current_user.id
      message.destroy