backend/app/controllers/api/likes_controller.rb

INSERT INTO "likes" ("user_id", "message_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["message_id", 28], ["created_at", "2024-05-11 14:47:02.058933"], ["updated_at", "2024-05-11 14:47:02.058933"]]
---
  def create
    # paramsはパラメータを参照
    like = Like.new(message_id: params[:id], user_id: current_api_user.id)

    if like.save

SELECT "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 22]]
---
  def destroy
    like = Like.find(params[:id])

    if like.destroy