backend/app/controllers/api/messages_controller.rb

  def index
    messages = Message.eager_load(:user, [likes: :user])
    messages_array = messages.map do |message|
      {
        id: message.id,
        user_id: message.user.id,
        name: message.user.name,
        content: message.content,
        email: message.user.email,
        created_at: message.created_at,
        # likesレコードを二次元配列で保持する
        likes: message.likes.map { |like| {id: like.id, email: like.user.email} }
---
SELECT "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "test@test.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    message = Message.find(params[:id])
    if message.update(message_params)
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
UPDATE "messages" SET "content" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["content", "aaaa"], ["updated_at", "2024-05-11 14:47:10.514945"], ["id", 22]]