backend/app/channels/room_channel.rb

  def receive(data)
    # Vueからemail,messageを含んだデータが送られてくる
    user = User.find_by(email: data['email'])
    if message = Message.create(content: data['message'], user_id: user.id)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test@test.com"], ["LIMIT", 1]]
INSERT INTO "messages" ("user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["content", "sss"], ["created_at", "2024-05-03 16:29:31.656022"], ["updated_at", "2024-05-03 16:29:31.656022"]]